# 1. Replace the NAN values with the correct value.

In [21]:
from QQUnivariate import QQUnivariate
import pandas as pd

In [22]:
dataset=pd.read_csv("Placement.csv")

In [23]:
dataset

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.00,Central,58.00,Others,Science,53.00,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

In [24]:
dataset.isnull().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [25]:
dataset.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [26]:
# Salary is set 0 for the  candidates status is not  placed
dataset["salary"].fillna(0,inplace=True)

In [27]:
status_notplaced = dataset[dataset['status']== "Not Placed"]

In [28]:
status_notplaced

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
3,4,M,56.0,Central,52.0,Central,Science,52.00,Sci&Tech,No,66.00,Mkt&HR,59.43,Not Placed,0.0
5,6,M,55.0,Others,49.8,Others,Science,67.25,Sci&Tech,Yes,55.00,Mkt&Fin,51.58,Not Placed,0.0
6,7,F,46.0,Others,49.2,Others,Commerce,79.00,Comm&Mgmt,No,74.28,Mkt&Fin,53.29,Not Placed,0.0
9,10,M,58.0,Central,70.0,Central,Commerce,61.00,Comm&Mgmt,No,54.00,Mkt&Fin,52.21,Not Placed,0.0
12,13,F,47.0,Central,55.0,Others,Science,65.00,Comm&Mgmt,No,62.00,Mkt&HR,65.04,Not Placed,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
198,199,F,67.0,Central,70.0,Central,Commerce,65.00,Others,No,88.00,Mkt&HR,71.96,Not Placed,0.0
201,202,M,54.2,Central,63.0,Others,Science,58.00,Comm&Mgmt,No,79.00,Mkt&HR,58.44,Not Placed,0.0
206,207,M,41.0,Central,42.0,Central,Science,60.00,Comm&Mgmt,No,97.00,Mkt&Fin,53.39,Not Placed,0.0
208,209,F,43.0,Central,60.0,Others,Science,65.00,Comm&Mgmt,No,92.66,Mkt&HR,62.92,Not Placed,0.0
214,215,M,62.0,Central,58.0,Others,Science,53.00,Comm&Mgmt,No,89.00,Mkt&HR,60.22,Not Placed,0.0

######  Analysis Result
Moved the value  to  zero  for the salary column with value 'nan'  because the student is  Not Placeed  so  he or she may not draw any salary

# 2. How many of the students  not placed

In [29]:
status_notplaced = dataset[dataset['status']== "Not Placed"]

In [30]:
status_notplaced

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
3,4,M,56.0,Central,52.0,Central,Science,52.00,Sci&Tech,No,66.00,Mkt&HR,59.43,Not Placed,0.0
5,6,M,55.0,Others,49.8,Others,Science,67.25,Sci&Tech,Yes,55.00,Mkt&Fin,51.58,Not Placed,0.0
6,7,F,46.0,Others,49.2,Others,Commerce,79.00,Comm&Mgmt,No,74.28,Mkt&Fin,53.29,Not Placed,0.0
9,10,M,58.0,Central,70.0,Central,Commerce,61.00,Comm&Mgmt,No,54.00,Mkt&Fin,52.21,Not Placed,0.0
12,13,F,47.0,Central,55.0,Others,Science,65.00,Comm&Mgmt,No,62.00,Mkt&HR,65.04,Not Placed,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
198,199,F,67.0,Central,70.0,Central,Commerce,65.00,Others,No,88.00,Mkt&HR,71.96,Not Placed,0.0
201,202,M,54.2,Central,63.0,Others,Science,58.00,Comm&Mgmt,No,79.00,Mkt&HR,58.44,Not Placed,0.0
206,207,M,41.0,Central,42.0,Central,Science,60.00,Comm&Mgmt,No,97.00,Mkt&Fin,53.39,Not Placed,0.0
208,209,F,43.0,Central,60.0,Others,Science,65.00,Comm&Mgmt,No,92.66,Mkt&HR,62.92,Not Placed,0.0
214,215,M,62.0,Central,58.0,Others,Science,53.00,Comm&Mgmt,No,89.00,Mkt&HR,60.22,Not Placed,0.0

###### Analysis Result
 67 of the students are not placed

# 3 Reason for non placement  from the dataset

In [31]:
dataset=pd.read_csv("Placement.csv")

In [32]:
dataset.drop('sl_no',inplace=True,axis=1)

In [33]:
status_notplaced = dataset[dataset['status']== "Not Placed"]

In [34]:
status_notplaced.describe()

           ssc_p      hsc_p   degree_p    etest_p      mba_p  salary
count  67.000000  67.000000  67.000000  67.000000  67.000000     0.0
mean   57.544030  58.395522  61.134179  69.587910  61.612836     NaN
std     8.394246   9.914090   6.365825  11.930687   5.705689     NaN
min    40.890000  37.000000  50.000000  50.000000  51.210000     NaN
25%    52.000000  51.000000  57.000000  60.000000  58.480000     NaN
50%    56.280000  60.330000  61.000000  67.000000  60.690000     NaN
75%    63.000000  64.000000  65.000000  76.500000  65.405000     NaN
max    77.800000  82.000000  79.000000  97.000000  75.710000     NaN

In [35]:
status_placed = dataset[dataset['status']== "Placed"]

In [36]:
status_placed.describe()

,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,148.000000,148.000000,148.000000,148.000000,148.000000,148.000000
mean,71.721486,69.926554,68.740541,73.238041,62.579392,288655.405405
std,8.715445,9.329268,6.518087,13.729333,5.884583,93457.452420
min,49.000000,50.830000,56.000000,50.000000,52.380000,200000.000000
25%,65.000000,63.000000,65.000000,60.000000,57.772500,240000.000000
50%,72.500000,68.000000,68.000000,72.000000,62.245000,265000.000000
75%,78.125000,75.250000,72.422500,85.000000,66.760000,300000.000000
max,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

###### Analyse  the result using  "mean"
Comparing the "mean" value between  Placed and Not Placed. 
As you can  see from the above data displayed the mean value of Placed and Not Placed  for columns ssc_p, hsc_p Degree_p mean value is lower in non_placed data set than the placed data set, could be the reason  for non placement

### Analyse  data  using the  actual values brute force method  to compare values of population

In [37]:
status_placed

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
4,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
7,M,82.00,Central,64.00,Central,Science,66.00,Sci&Tech,Yes,67.0,Mkt&Fin,62.14,Placed,252000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
209,M,62.00,Central,72.00,Central,Commerce,65.00,Comm&Mgmt,No,67.0,Mkt&Fin,56.49,Placed,216000.0
210,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0

In [38]:
#Extract the Placed data  for  comparison analysis
status_placed.to_csv("Status_Placed.csv",index=False)

In [39]:
status_notplaced

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
3,M,56.0,Central,52.0,Central,Science,52.00,Sci&Tech,No,66.00,Mkt&HR,59.43,Not Placed,NaN
5,M,55.0,Others,49.8,Others,Science,67.25,Sci&Tech,Yes,55.00,Mkt&Fin,51.58,Not Placed,NaN
6,F,46.0,Others,49.2,Others,Commerce,79.00,Comm&Mgmt,No,74.28,Mkt&Fin,53.29,Not Placed,NaN
9,M,58.0,Central,70.0,Central,Commerce,61.00,Comm&Mgmt,No,54.00,Mkt&Fin,52.21,Not Placed,NaN
12,F,47.0,Central,55.0,Others,Science,65.00,Comm&Mgmt,No,62.00,Mkt&HR,65.04,Not Placed,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
198,F,67.0,Central,70.0,Central,Commerce,65.00,Others,No,88.00,Mkt&HR,71.96,Not Placed,NaN
201,M,54.2,Central,63.0,Others,Science,58.00,Comm&Mgmt,No,79.00,Mkt&HR,58.44,Not Placed,NaN
206,M,41.0,Central,42.0,Central,Science,60.00,Comm&Mgmt,No,97.00,Mkt&Fin,53.39,Not Placed,NaN
208,F,43.0,Central,60.0,Others,Science,65.00,Comm&Mgmt,No,92.66,Mkt&HR,62.92,Not Placed,NaN
214,M,62.0,Central,58.0,Others,Science,53.00,Comm&Mgmt,No,89.00,Mkt&HR,60.22,Not Placed,NaN

In [40]:
#Extract the Not Placed data  for  comparison analysis
status_notplaced.to_csv("Status_Not_Placed.csv",index=False)

In [41]:
#Load  the Placed_Vs_Not_Placed Comparison data -Manually compare
status_comparison=pd.read_csv("Placed_NotPlaced_Summary.csv",)

In [42]:
status_comparison

,Column Name,Column Value,148 Placed- Value,Placed %,67 Not Placed- Value,Not Placed %,Diffrence (Placed % - Not Placed%)
0,SSC_B,Others,70,47,29,43,4
1,SSC_B,Central,78,53,38,57,-4
2,HSC_B,Central,57,39,27,40,-2
3,HSC_B,Others,91,61,40,60,2
4,HSC_S,Arts,6,4,5,7,-3
5,HSC_S,Commerce,79,53,34,51,3
6,HSC_S,Science,63,43,28,42,1
7,DEGRREE_T,Comm & Mgmt,102,69,43,64,5
8,DEGRREE_T,Others,5,3,6,9,-6
9,DEGRREE_T,SCI&TECH,41,28,18,27,1
10,WORKEX,Yes,54,39,57,85,-46
11,WORKEX,No,84,61,10,15,46
12,SPECIALIZATION,MKT&FIN,95,64,25,37,27
13,SPECIALIZATION,MKT&HR,53,36,42,63,-27
14,ssc_p,<=60,12,8,40,60,-52
15,ssc_p,>60 & <=70,57,39,22,33,6
16,ssc_p,>70,79,53,5,7,46
17,hsc_p,<=60,18,12,33,49,-37
18,hsc_p,>60 & <=70,66,45,28,42,3
19,hsc_p,>70,64,43,6,9,34
20,Degree_p,<=60,15,10,33,49,-39
21,Degree_p,>60 & <=70,77,52,28,42,10
22,Degree_p,>70,56,38,6,9,29
23,etest_p,<=60,38,26,21,31,-6
24,etest_p,>60 & <=70,31,21,17,25,-4
25,etest_p,>70,79,53,29,43,10
26,mba_p,<=60,53,36,28,42,-6
27,mba_p,>60 & <=70,76,51,34,51,1
28,mba_p,>70,19,13,5,7,5

###### Analysis Result
 As you can  see from the above  comparison,  Work Experience, ssc_p, hsc_p Degree_p percent actual values 
 in the not placed data set is lower than the placed data set could be the reason  for non placement

# 4.Find the relationship between "salary" & "mba_p"

###### Find the covariance between salary & mba_p columns

In [43]:
# Covariance calculates the average product of deviations from mean.
#
# Covariance: Variance of two variables (linear relationship between two variables) X & Y together is Covariance 
#    (How they change or  do not change together). If both the values are increasing and directly proportional 
#    to each other then it is a positive covariance.If one value is increasing and the other value is decreasing then 
#    it is a negative covariance.

In [44]:
#Covariance is a statistical measure that indicates the extent to which two random variables change together. 
#  It quantifies the joint variability of the variables, showing whether they tend to increase or decrease in tandem. 
#  A positive covariance indicates that the variables move in the same direction, while a negative covariance indicates 
#  they move in opposite directions. Covariance is similar to variance, but while variance measures the variability 
#  of a single variable, covariance measures how two variables vary together.

In [45]:
dataset.cov()

,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
ssc_p,117.228377,60.348373,42.897137,37.659225,24.535952,2.877739e+04
hsc_p,60.348373,118.755706,34.819820,35.461678,22.555846,6.697772e+04
degree_p,42.897137,34.819820,54.151103,21.929469,17.272020,-1.173995e+04
etest_p,37.659225,35.461678,21.929469,176.251018,16.886973,2.287876e+05
mba_p,24.535952,22.555846,17.272020,16.886973,34.028376,9.624979e+04
salary,28777.386468,66977.716032,-11739.948520,228787.619507,96249.789024,8.734295e+09

###### Analysis Result
Result salary increases and  decreases  with mba_p positively and negatively

# 5.Which specialization is getting minimum salary

In [46]:
dataset.describe()

,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [47]:
min_salary = dataset.salary.min()

In [48]:
min_salary

200000.0

In [49]:
spl_with_min_salary = dataset[dataset['salary']== min_salary]

In [50]:
spl_with_min_salary

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
1,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
15,F,65.00,Central,75.00,Central,Commerce,69.00,Comm&Mgmt,Yes,72.0,Mkt&Fin,64.66,Placed,200000.0
44,F,77.00,Others,73.00,Others,Commerce,81.00,Comm&Mgmt,Yes,89.0,Mkt&Fin,69.70,Placed,200000.0
50,F,75.20,Central,73.20,Central,Science,68.40,Comm&Mgmt,No,65.0,Mkt&HR,62.98,Placed,200000.0
107,M,82.00,Others,90.00,Others,Commerce,83.00,Comm&Mgmt,No,80.0,Mkt&HR,73.52,Placed,200000.0
135,F,72.00,Central,56.00,Others,Science,69.00,Comm&Mgmt,No,55.6,Mkt&HR,65.63,Placed,200000.0

###### Analysis Result
Mkt&Fin  and Mkt&HR  specialization are  getting  minimum salary of 200000

# 6.How many of them getting above 500000 salary

In [51]:
dataset.describe()

,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [52]:
dataset[dataset['salary']== 500000]

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
77,M,64.00,Others,80.00,Others,Science,65.00,Sci&Tech,Yes,69.0,Mkt&Fin,57.65,Placed,500000.0
163,M,63.00,Others,67.00,Others,Science,64.00,Sci&Tech,No,75.0,Mkt&Fin,66.46,Placed,500000.0
174,M,73.24,Others,50.83,Others,Science,64.27,Sci&Tech,Yes,64.0,Mkt&Fin,66.23,Placed,500000.0

###### Analysis Result
3 of the Males with specializaion Mkt&Fin are getting the Salary 500000.

# Hypothesis  questions  7, 8 & 11

## 7.Test the Analysis of Variance between "etest_p" & "mba_p" at signifance level 5%.
(Make decision using Hypothesis Testing)

###### Hypothesis : A premise or claim that we want to test
Null Hypothesis-  Ho (default  hypothesis or  currently accepted hypothesis or currently accepted value for a parameter)

Alternative Hypothesis- Ha-  Also called Research hypothesis, Involves a claim to be tested

###### Unpaired "ttest_ind" Independent test

In [53]:
from scipy.stats import ttest_ind
dataset=dataset.dropna()
data_etest_p = dataset['etest_p'] 
data_mba_p = dataset['mba_p']
t_stat, p_value = ttest_ind(data_etest_p,data_mba_p)
ttest_ind(data_etest_p,data_mba_p)

Ttest_indResult(statistic=8.6808236413377, pvalue=2.751119689883288e-16)

In [54]:
#Analysis Result
if p_value < 5:
    print("Reject the null hypothesis: The sample mean is significantly different.")
else:
    print("Fail to reject the null hypothesis: No significant difference.")

Reject the null hypothesis: The sample mean is significantly different.

# 8.Test the similarity between the degree_t (Sci&Tech) & Special(Mkt&HR) 
with respect to salary at significance level of 5% (Makedecision using Hypothesis Testing)

###### Hypothesis : A premise or claim that we want to test
Null Hypothesis-  Ho (default  hypothesis or  currently accepted hypothesis or currently accepted value for a parameter)

Alternative Hypothesis- Ha-  Also called Research hypothesis, Involves a claim to be tested

In [55]:
from scipy.stats import ttest_ind
dataset=dataset.dropna()
data_degree_t = dataset[dataset['degree_t']=='Sci&Tech']['salary']
data_special = dataset[dataset['specialisation']=='Mkt&HR']['salary']
t_stat, p_value = ttest_ind(data_degree_t ,data_special)
ttest_ind(data_degree_t ,data_special)

Ttest_indResult(statistic=2.734391160944239, pvalue=0.007496896218767113)

In [56]:
#Analysis Result
if p_value < 5:
    print("Reject the null hypothesis: The sample mean is significantly different.")
else:
    print("Fail to reject the null hypothesis: No significant difference.")

Reject the null hypothesis: The sample mean is significantly different.

### 11.Test the similarity between the degree_t(Sci&Tech)with respect to etest_p and mba_p at significance level of 5%.(Make decision using Hy-pothesis Testing)

In [57]:
from scipy.stats import ttest_ind
dataset=dataset.dropna()
data_etest_p = dataset[dataset['degree_t']=='Sci&Tech']['etest_p']
data_mba_p = dataset[dataset['degree_t']=='Sci&Tech']['mba_p']
t_stat, p_value = ttest_ind(data_etest_p ,data_mba_p)
ttest_ind(data_degree_t ,data_special)

Ttest_indResult(statistic=2.734391160944239, pvalue=0.007496896218767113)

In [58]:
#Analysis Result
if p_value < 5:
    print("Reject the null hypothesis: The sample mean is significantly different.")
else:
    print("Fail to reject the null hypothesis: No significant difference.")

Reject the null hypothesis: The sample mean is significantly different.